app/views/partidas/_form.html.erb

    <%= form.label "Selecionar Jogadores" %>
    <%= collection_check_boxes(:User, :user_id, User.all, :id ,:nome) %>
---
SELECT "users".* FROM "users"