app/controllers/participantes_controller.rb

  def index
    @participantes = Participante.all
---
SELECT "participantes".* FROM "participantes"

  def create
    @participante = Participante.new(participante_params)

    respond_to do |format|
      if @participante.save
---
INSERT INTO "participantes" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-06-04 05:28:06.635416"], ["updated_at", "2019-06-04 05:28:06.635416"]]

  def destroy
    @participante.destroy
---
DELETE FROM "participantes" WHERE "participantes"."id" = ?  [["id", 1]]

    def set_participante
      @participante = Participante.find(params[:id])
---
SELECT  "participantes".* FROM "participantes" WHERE "participantes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]