app/controllers/partidas_controller.rb

SELECT "partidas".* FROM "partidas"
---
  def index
    @partidas = Partida.all

INSERT INTO "partidas" ("Data", "Local", "Horario", "id_partida", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Data", "2017-03-06"], ["Local", "cascascs ss"], ["Horario", "2019-06-04"], ["id_partida", 1], ["created_at", "2019-06-04 04:05:25.497241"], ["updated_at", "2019-06-04 04:05:25.497241"]]
---
  def create
    @partida = Partida.new(partida_params)

    respond_to do |format|
      if @partida.save

DELETE FROM "partidas" WHERE "partidas"."id" = ?  [["id", 1]]
---
  def destroy
    @partida.destroy

SELECT  "partidas".* FROM "partidas" WHERE "partidas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_partida
      @partida = Partida.find(params[:id])