app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("nome", "idade", "telefone", "id_usuario", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Mateus rodrigues"], ["idade", 23], ["telefone", 34171357], ["id_usuario", 1], ["created_at", "2019-06-04 03:58:05.850408"], ["updated_at", "2019-06-04 03:58:05.850408"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "id_usuario" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["id_usuario", 3], ["updated_at", "2019-06-04 07:24:17.830104"], ["id", 2]]