app/views/participantes/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= form.label :user %>
    <%= collection_select(:user, :user_id, User.all, :id, :nome) %>

SELECT "users".* FROM "users"
---
    <%= form.label :partida %>
    <%= collection_select(:user, :user_id, User.all, :id, :nome) %>